In [5]:
import pandas as pd
import numpy as np

# testando as extensões criando dataframes com lacunas
data = {
    "Nome": ["Ana Silva", "Carlos Souza", "Mariana Lima", "João Pereira", "Luciana Costa"],
    "Idade": [28, np.nan, 42, 26, np.nan],
    "Cidade": ["São Paulo", "Rio de Janeiro", np.nan, "Curitiba", "Porto Alegre"],
    "Salário": [4500, 6000, np.nan, 4000, 5000]
}

df = pd.DataFrame(data)

display(df)

excelFile = "dados_ausentes.xlsx"

# index True adiciona uma coluna de numeração, mesmo já existindo no excel
df.to_excel(excelFile, index=False)

            Nome  Idade          Cidade  Salário
0      Ana Silva   28.0       São Paulo   4500.0
1   Carlos Souza    NaN  Rio de Janeiro   6000.0
2   Mariana Lima   42.0             NaN      NaN
3   João Pereira   26.0        Curitiba   4000.0
4  Luciana Costa    NaN    Porto Alegre   5000.0